app/controllers/epicenter_controller.rb

  def feed
    @following_tweets = []

    Tweet.all.each do |tweet|
---
SELECT "tweets".* FROM "tweets"

  def show_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def now_following
    # We are adding the user.id of the user you want to
    # follow to your following array.
    # and we want to make sure it's saved in there as an integer
    current_user.following.push(params[:id].to_i)
---
UPDATE "users" SET "following" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["following", "---\n- 1\n"], ["updated_at", "2017-05-26 19:53:43.733866"], ["id", 2]]

  def tag_tweets
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def all_users
    @users = User.all
---
SELECT "users".* FROM "users"

  def following
    @user = User.find(params[:id])
    @users = []

    User.all.each do |user|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def followers
    @user =  User.find(params[:id])
    @users = []

    User.all.each do |user|
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users"