app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

  def create
    @tweet = Tweet.create(tweet_params)

    @tweet = get_tagged(@tweet)

    #create action continues down here

    puts @tweet

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "test"], ["user_id", 1], ["created_at", "2017-05-26 19:24:23.786840"], ["updated_at", "2017-05-26 19:24:23.786840"]]
INSERT INTO "tags" ("phrase", "created_at", "updated_at") VALUES (?, ?, ?)  [["phrase", "#noob"], ["created_at", "2017-06-01 21:56:00.576074"], ["updated_at", "2017-06-01 21:56:00.576074"]]
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "This is a test! https://techtalentsouth.com/locations/charlotte/ Do you know what I'm saying."], ["updated_at", "2017-05-26 20:48:09.830354"], ["id", 4]]

  def update
    respond_to do |format|
      if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["message", "jh"], ["updated_at", "2017-06-01 23:42:04.632843"], ["id", 47]]

    def set_tweet
      @tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]